app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "price", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-06-15 12:50:28.336737"], ["description", "wert"], ["price", 23.0], ["title", "wert"], ["updated_at", "2015-06-15 12:50:28.336737"], ["user_id", 1]]
UPDATE "products" SET "category_id" = $1, "updated_at" = $2 WHERE "products"."id" = 1  [["category_id", 1], ["updated_at", "2015-06-15 12:50:28.361572"]]
---
  def create
    prod = Product.new(product_params)
    prod.user = current_user
    self.product = prod

    if product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 2]]
---
  def destroy
    product.destroy