app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "created_at", "rating", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "wewe"], ["created_at", "2015-06-15 13:16:47.711098"], ["rating", 4], ["updated_at", "2015-06-15 13:16:47.711098"], ["user_id", 1]]
UPDATE "reviews" SET "product_id" = $1, "updated_at" = $2 WHERE "reviews"."id" = 1  [["product_id", 2], ["updated_at", "2015-06-15 13:16:47.728711"]]
---
  def create
    rev = Review.new(review_params)
    rev.user = current_user
    self.review = rev

    if review.save