app/views/products/show.html.haml


- if product.reviews.count == 0
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."product_id" = $1  [["product_id", 6]]